<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Download recipe for Jamf Protect's installer from a Jamf Protect tenant. Jamf does not provide a public download URL,
        so you will need to create a recipe override and enter the URL and UUID Jamf provides into the DOWNLOAD_URL and DOWNLOAD_UUID values of the override.
    </string>
	<key>Identifier</key>
	<string>com.github.notverypc.autopkg-recipes.munki.JamfProtect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JamfProtect</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/jamfprotect</string>
        <key>DOWNLOAD_URL</key>
        <string>Put_Jamf_Protect_Installer_download_URL_into_AutoPkg_recipe_override</string>
        <key>DOWNLOAD_UUID</key>
        <string>Put_Jamf_Protect_Installer_download_UUID_into_AutoPkg_recipe_override</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Security</string>
			<key>description</key>
			<string>Apple Mobile and Mac endpoint protection. Endpoint security, threat defense and content filtering.</string>
			<key>developer</key>
			<string>Jamf</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>	
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.installer.jamfprotect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>MUNKI_REPO</key>
				<string>%MUNKI_REPO%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>